Author : Akash Pandey
DOMAIN : Data Science

In [ ]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
kashti=sns.load_dataset('titanic')
#ks1=kashti
#ks2=kashti

In [3]:
kashti.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [4]:
kashti.head()#here we are checking by default 5 value upper

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
kashti.tail()#here we are checking by default 5 value lowwer

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [6]:
kashti.shape

(891, 15)

In [7]:
#here we can use all arithmetic operators [+,-,*,%,/,etc]
kashti['age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [8]:
(kashti['age']+10).head(10) #here if need only 10 value then we can do with that function if we will remove head() then it will fallow on all data set

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
5     NaN
6    64.0
7    12.0
8    37.0
9    24.0
Name: age, dtype: float64

In [9]:
#Dealing with missing values=we can fill null values with the help of 
#[mean,mode,median,most-frequncy] and we can directly delete and some time leave like that

In [10]:
kashti.isnull().sum() # here we check null value with this function

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [11]:
kashti['age'].isnull().sum() #here we can ckeck spcificaly null values

177

In [12]:
kashti['deck'].isnull().sum() #here we can ckeck spcificaly null values

688

In [13]:
kashti.dropna(subset=['deck'],axis=0,inplace=True) #here i removed all null values of deck

In [14]:
kashti['deck'].isnull().sum() #here we don't have any null value in deck

0

In [15]:
kashti.shape #here it is showing (203,15) i deteled that reasion

(203, 15)

In [16]:
kashti.dropna(subset=['age'],axis=0,inplace=True)#here i removed all null values of age

In [17]:
kashti['age'].isnull().sum() #here we don't have any null value in deck

0

In [18]:
kashti.shape

(184, 15)

In [65]:
kashti=sns.load_dataset('titanic')
ks1=kashti
ks2=kashti

In [66]:
#Replacing missing value with mean valueb is nothing but average value

In [67]:
mean=ks1['age'].mean()
mean                    #here i am checking mean

29.69911764705882

In [68]:
ks1.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [69]:
ks1['age'].mean()

29.69911764705882

In [70]:
ks1['age'].replace(np.nan,mean,inplace=True) # here i replace all null value with the maen 
                                #similar we can do with mode,median,frq value

In [71]:
ks1.isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [72]:
ks1.dropna(subset=['deck'],axis=0,inplace=True)

In [73]:
ks1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

In [74]:
ks1.dropna(subset=['embarked'],axis=0,inplace=True)

In [75]:
ks1.dropna(subset=['embark_town'],axis=0,inplace=True)

In [76]:
ks1.isnull().sum() #now all null value has deleted

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [77]:
ks1['age']= ks1['age']*365 #here if any one wants age into days then we can do with this
ks1.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,13870.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,12775.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,19710.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,1460.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,21170.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [81]:
ks1['age'] = ks1['age'].astype(str).str.rstrip('0')
ks1.head() # i have removed zero with this function

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1.0,1,female,13870.,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1.0,1,female,12775.,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0.0,1,male,19710.,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1.0,3,female,1460.,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1.0,1,female,21170.,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [57]:
#data formatting ot data standardization
#means nothing but to make data usefull and understandable easy to work with that
#ex-like some data stores in different data type to change into correct data type like int into float
#and object(str) into int either float

In [78]:
ks2.dtypes # in this i have "survived" in "int64"

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [79]:
ks2['survived'] = ks2['survived'].astype('float64')
ks2.dtypes                        # in this i have changed "survived" columns "int64" into "float64"

survived        float64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [84]:
ks2['alive'] = ks2['alive'].replace({'yes': 1, 'no': 0})
ks2.dtypes

#here with replace value but if we have in our data only some limited values live ({'yes':1,'no':0})
#like this we can do but not when ervery values are different

survived        float64
pclass            int64
sex              object
age              object
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive             int64
alone              bool
dtype: object

In [92]:
ks2.rename(columns={'age':'age in days'},inplace=True) 
ks2.head(2) #here i rename file name before name was 'age' and after perfromed opration it became 'age in days'

,survived,pclass,sex,age in days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1.0,1,female,13870.,1,0,71.2833,C,First,woman,False,C,Cherbourg,1,False
3,1.0,1,female,12775.,1,0,53.1000,S,First,woman,False,C,Southampton,1,False

In [ ]:
# DATA NORMALIZATION 
#normal and gaussion distribution that is showing the data near by the mean value and half-half values lies
#right side and half-half value lies left side it aslo called as a bell carve distribution
#uniform the  data
#every data gives same inpact
#it makes data set or variable in the range into (0 to 1) form

In [130]:
kashti.info()
ks6=kashti

<class 'pandas.core.frame.DataFrame'>
Index: 201 entries, 1 to 889
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     201 non-null    float64
 1   pclass       201 non-null    int64
 2   sex          201 non-null    object
 3   age in days  201 non-null    float64
 4   sibsp        201 non-null    int64
 5   parch        201 non-null    int64
 6   fare         201 non-null    float64
 7   embarked     201 non-null    object
 8   class        201 non-null    category
 9   who          201 non-null    object
 10  adult_male   201 non-null    bool
 11  deck         201 non-null    category
 12  embark_town  201 non-null    object
 13  alive        201 non-null    int64
 14  alone        201 non-null    bool
dtypes: bool(2), category(2), float64(3), int64(4), object(4)
memory usage: 20.1+ KB

In [115]:
kashti['age in days'] = kashti['age in days'].astype('float64') #here i convert age in days into 'float64'

In [116]:
ks4=kashti[['class']] #hre if we want to take one column then we can do with this
ks4.head()

    class
1   First
3   First
6   First
10  Third
11  First

In [117]:
ks5=kashti[['age in days','fare']]
ks5

     age in days     fare
1        13870.0  71.2833
3        12775.0  53.1000
6        19710.0  51.8625
10        1460.0  16.7000
11       21170.0  26.5500
..           ...      ...
871      17155.0  52.5542
872      12045.0   5.0000
879      20440.0  83.1583
887       6935.0  30.0000
889       9490.0  30.0000

[201 rows x 2 columns]

In [121]:
#method of normalization
#1-simple-feature-scaling
#   *x(new)=x(old)/x(max)
    
#2-min-max method
#3-z-score(standard score)-3 to +3
#4-log transformation

In [119]:
ks5['fare'] =ks5['fare']/ks5['fare'].max()
ks5['age in days'] = ks5['age in days'] / ks5['age in days'].max()
ks5.head()  #here i am using simple-feature-scaling in this is farmulx(new)=x(old)/x(max)
#data came into range means(0 to 1) but different are same but range became less

C:\Users\akash pandey\AppData\Local\Temp\ipykernel_21472\768930532.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ks5['fare'] =ks5['fare']/ks5['fare'].max()
C:\Users\akash pandey\AppData\Local\Temp\ipykernel_21472\768930532.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ks5['age in days'] = ks5['age in days'] / ks5['age in days'].max()

    age in days      fare
1        0.4750  0.139136
3        0.4375  0.103644
6        0.6750  0.101229
10       0.0500  0.032596
11       0.7250  0.051822

In [125]:
ks6['fare'] = (ks6['fare']-ks6['fare'].min())/(ks6['fare'].max()-ks6['fare'].min())
#same thing we can do with "age in days" too
ks6.head() #min-max method

,survived,pclass,sex,age in days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1.0,1,female,13870.0,1,0,0.139136,C,First,woman,False,C,Cherbourg,1,False
3,1.0,1,female,12775.0,1,0,0.103644,S,First,woman,False,C,Southampton,1,False
6,0.0,1,male,19710.0,0,0,0.101229,S,First,man,True,E,Southampton,0,True
10,1.0,3,female,1460.0,1,1,0.032596,S,Third,child,False,G,Southampton,1,False
11,1.0,1,female,21170.0,0,0,0.051822,S,First,woman,False,C,Southampton,1,True

In [140]:
ks7.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [151]:
kashti=sns.load_dataset('titanic')
ks7=kashti
ks8=kashti

In [152]:
ks7['fare'].head()

0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
Name: fare, dtype: float64

In [153]:
ks7['fare'] = (ks7['fare']-ks7['fare'].mean())/ks7['fare'].std()
ks7['fare'].head(10) #here i used z-score(standard score)-3 to +3

0   -0.502163
1    0.786404
2   -0.488580
3    0.420494
4   -0.486064
5   -0.477848
6    0.395591
7   -0.223957
8   -0.424018
9   -0.042931
Name: fare, dtype: float64

In [147]:
ks8['fare']=np.log(ks8['fare'])
ks8['fare'].head() #log transformation

C:\Users\akash pandey\AppData\Roaming\Python\Python310\site-packages\pandas\core\arraylike.py:396: RuntimeWarning: divide by zero encountered in log
  result = getattr(ufunc, method)(*inputs, **kwargs)

0    1.981001
1    4.266662
2    2.070022
3    3.972177
4    2.085672
Name: fare, dtype: float64

In [ ]:
#binning or categories(bins) into some part like 'age' column is there categoris(divide) 
#into ('child','adult','old')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    object
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(1), int64(4), object(6)
memory usage: 80.7+ KB

In [199]:
ks10=sns.load_dataset('titanic')

In [200]:
ks10.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [201]:
ks10['age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [202]:
bins = np.linspace(min(ks10['age']), max(ks10['age']), 4)
age_groups = ['child', 'adult', 'old']
ks10['age'] = pd.cut(ks10['age'], bins, labels=age_groups, include_lowest=True)
ks10['age']
#i categories(bins) into

0      child
1      adult
2      child
3      adult
4      adult
       ...
886    adult
887    child
888      NaN
889    child
890    adult
Name: age, Length: 891, dtype: category
Categories (3, object): ['child' < 'adult' < 'old']

In [203]:
ks10.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,child,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,adult,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,child,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,adult,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,adult,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

THANK YOU